---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCGuidKey
source: html/7dc686ab-07b2-c18e-4893-14506aad2e1c.htm
---
# Autodesk.Revit.DB.IFC.IFCGuidKey

IFCGuidKey is used for case-sensitive comparison of GUID values for maps and sets.

## Syntax (C#)
```csharp
public class IFCGuidKey : IDisposable
```